benard-convection/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       145500;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       148000;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       150500;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       152500;
    }
)

// ************************************************************************* //
