benard-convection/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16;

method            simple;

simpleCoeffs
{
    n           ( 4 4 1 );
    delta       0.001;
}

hierarchicalCoeffs
{
    n           ( 1 1 1 );
    delta       0.001;
    order       xyz;
}

manualCoeffs
{
    datafile       "";
}

distributed     no;


roots           ( );


// ************************************************************************* //
